conf/src/Catalogs/ВерсииПроекта/ВерсииПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииПроекта</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ВерсияМеханизмаОбновленияИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ветка</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВключенияБиблиотек</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиКПредварительномуВстраиванию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВнешнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <comment>Начало разработки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРазработки</name>
    <comment>Окончание разработки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредстоящейСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияПоддержки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяХранилищаДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодредакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьКонфигурациюИзХранилищаПриЗагрузкеМетаданных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяХранилищаДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПубликуемыйНомерВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПатчи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВерсииВключаемыхПроектов</name>
    <attributes>
      <name>Версия</name>
      <type>
        <types>CatalogRef.ВерсииПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтличияВИменахМетаданных</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтличияВСоставеПодсистем</name>
    <attributes>
      <name>Подсистема</name>
      <type>
        <types>CatalogRef.Подсистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектНужноДобавитьВПодсистему</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Enums/РежимРазработки/РежимРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимРазработки</name>
  <enumValues>
    <name>БезИзменений</name>
  </enumValues>
  <enumValues>
    <name>ВGitРепозитории</name>
  </enumValues>
  <enumValues>
    <name>ВХранилище</name>
  </enumValues>
</mdclass:Enum>

conf/src/Enums/ТипыВеток/ТипыВеток.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВеток</name>
  <enumValues>
    <name>ОсновнаяВеткаПроекта</name>
  </enumValues>
  <enumValues>
    <name>ВеткаВерсии</name>
  </enumValues>
  <enumValues>
    <name>ВеткаТехническогоПроекта</name>
  </enumValues>
  <enumValues>
    <name>ВеткаДляИсправленияОшибок</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/ВерсииПроекта/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		
		Владелец = Проекты.ПроектПоУмолчанию();
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
		
		ПорядковыйНомер = Справочники.ВерсииПроекта.ОчереднойПорядковыйНомерВерсии(Владелец);
		
		СоставляющиеНомера = СоставляющиеНомераПоследнейВерсии();
		НомерРедакции    = СоставляющиеНомера.НомерРедакции;
		НомерПодредакции = СоставляющиеНомера.НомерПодредакции;
		НомерВерсии      = СоставляющиеНомера.НомерВерсии + 1;
		Ветка            = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Ветка");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если ЗначениеЗаполнено(ДатаОкончанияРазработки) И ДатаНачалаРазработки > ДатаОкончанияРазработки Тогда
		ТекстСообщения = НСтр("ru='Неверно указаны даты начала и окончания разработки'");
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончанияРазработки) И ЗначениеЗаполнено(ПлановаяДатаВыпуска)
		И ДатаОкончанияРазработки > ПлановаяДатаВыпуска Тогда
		ТекстСообщения = НСтр("ru='Неверно указаны даты окончания разработки и выпуска'");
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
	ПроверитьНаличиеДублейНомераВерсии(Отказ);
	
	Если НЕ ОбновлятьКонфигурациюИзХранилищаПриЗагрузкеМетаданных 
		ИЛИ Ветка.РежимРазработки <> Перечисления.РежимРазработки.ВХранилище Тогда
		НепроверяемыеРеквизиты.Добавить("ИмяПользователяХранилищаДляЗагрузкиМетаданных");
	КонецЕсли;
	
	Если НепроверяемыеРеквизиты.Количество()>0 Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПорядковыйНомер = Справочники.ВерсииПроекта.ОчереднойПорядковыйНомерВерсии(Владелец);
	
	ДополнительныеРеквизиты.Очистить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		СтрокаРеквизитов = "ДатаНачалаРазработки";
		РеквизитыСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтрокаРеквизитов);
		ДатаНачалаРазработкиДоЗаписи = РеквизитыСсылки.ДатаНачалаРазработки;
	КонецЕсли;
	
	Если Ветка.Тип = Перечисления.ТипыВеток.ВеткаВерсии Тогда
		ОтличияВИменахМетаданных.Очистить();
		ОтличияВСоставеПодсистем.Очистить();
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДатаНачалаРазработкиДоЗаписи", ДатаНачалаРазработкиДоЗаписи);
	
	КоллекцияИзмененныхОбъектов = Новый Массив;
	ДополнительныеСвойства.Вставить("КоллекцияИзмененныхОбъектов", КоллекцияИзмененныхОбъектов);
	Версионирование.ЗарегистрироватьИзмененияОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// При изменении даты начала разработки в ошибках может потребоваться
	// пересчет срока отработки
	
	Если НЕ ЭтоНовый() И (ДатаНачалаРазработки > ТекущаяДата() ИЛИ ДатаНачалаРазработки = '00010101') Тогда
		Если ДополнительныеСвойства.Свойство("ДатаНачалаРазработкиДоЗаписи") Тогда
			
			ДатаНачалаРазработкиДоЗаписи = ДополнительныеСвойства.ДатаНачалаРазработкиДоЗаписи;
			
			Если ДатаНачалаРазработкиДоЗаписи <> ДатаНачалаРазработки Тогда
				
				ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
				ПараметрыВыполнения.Вставить("ЗапуститьВФоне", Истина);
				ПараметрыВыполнения.Вставить("ОжидатьЗавершение", 0);
				
				ИмяПроцедуры = "Справочники.Ошибки.ЗаписатьОшибкиСоСменойСрокаОтработки";
				ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ИмяПроцедуры, Ссылка);
				
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаличиеДублейНомераВерсии(Отказ)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВерсииПроекта.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВерсииПроекта КАК ВерсииПроекта
	|ГДЕ
	|	ВерсииПроекта.Владелец = &Проект
	|	И ВерсииПроекта.Ссылка <> &Ссылка
	|	И ВерсииПроекта.ПорядковыйНомер = &ПорядковыйНомер"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Проект", Владелец);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПорядковыйНомер", ПорядковыйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = НСтр("ru='Версия с указанным порядковым номером уже существует'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,"ПорядковыйНомер");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция СоставляющиеНомераПоследнейВерсии()
	
	Результат = Новый Структура;
	Результат.Вставить("НомерРедакции", 0);
	Результат.Вставить("НомерПодредакции", 0);
	Результат.Вставить("НомерВерсии", 0);
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсииПроекта.НомерРедакции КАК НомерРедакции,
	|	ВерсииПроекта.НомерПодредакции КАК НомерПодредакции,
	|	ВерсииПроекта.НомерВерсии КАК НомерВерсии
	|ИЗ
	|	Справочник.ВерсииПроекта КАК ВерсииПроекта
	|ГДЕ
	|	ВерсииПроекта.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВерсииПроекта.ПорядковыйНомер УБЫВ"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
